SM_для_EDT/src/Documents/рарусРасходТМЦ/рарусРасходТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>рарусРасходТМЦ</name>
  <comment>rarus makole</comment>
  <basedOn>Document.рарусИнвентаризацияТМЦ</basedOn>
  <basedOn>Document.рарусИзменениеСтатусаТМЦ</basedOn>
  <basedOn>Document.рарусЗаказКлиента</basedOn>
  <basedOn>Document.рарусЗаказНаПеремещение</basedOn>
  <registerRecords>AccumulationRegister.рарусТоварыКОтгрузке</registerRecords>
  <registerRecords>AccumulationRegister.рарусИмуществоНаСудах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.рарусВидыОперацийРасходаТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.впАктОВыполненииЭтапаРабот</types>
      <types>DocumentRef.рарусЗаказНаПеремещение</types>
      <types>DocumentRef.рарусЗаказКлиента</types>
      <types>DocumentRef.рарусИнвентаризацияТМЦ</types>
      <types>DocumentRef.впПриходТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>СформированСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТМЦ</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Enums/рарусВидыОперацийРасходаТМЦ/рарусВидыОперацийРасходаТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рарусВидыОперацийРасходаТМЦ</name>
  <comment>rarus makole ФТ.ИМ.01.01</comment>
  <enumValues>
    <name>СоСклада</name>
  </enumValues>
  <enumValues>
    <name>ИзВыданного</name>
  </enumValues>
  <enumValues>
    <name>БУ</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Documents/рарусРасходТМЦ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
	    И ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
		Если ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.рарусИнвентаризацияТМЦ") Тогда
			рарусИмущественныйУчетСервер.ЗаполнитьРасходТМЦПоИнвентаризации(ЭтотОбъект, ДанныеЗаполнения);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.впПриходТМЦ") Тогда
			рарусИмущественныйУчетСервер.ЗаполнитьРасходТМЦПоПриходТМЦ(ЭтотОбъект, ДанныеЗаполнения);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.рарусИзменениеСтатусаТМЦ") Тогда
			рарусИмущественныйУчетСервер.ЗаполнитьРасходТМЦПоИзменениеСтатусаТМЦ(ЭтотОбъект, ДанныеЗаполнения);
		КонецЕсли;
	КонецЕсли;	
	
	Если ЭтоНовый() Тогда
		ИнициализироватьДокумент(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ПроверитьДоступностьРедактированияОбъекта(Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	// ++ rarus makole 2021-03-31
	Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	СформированСМ = Истина;
	// -- rarus makole 2021-03-31
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДоступностьРедактированияОбъекта

Процедура ПроверитьДоступностьРедактированияОбъекта(Отказ)
	// ++ rarus makole 2021-03-31
	// После загрузки объекта из БМ ему устанавливается состояние ЗагруженИзБМ до окончания загрузки.
	// Затем статус меняется на Отправлен и редактирование созданных в БМ документов запрещается
	Отказ = Отказ ИЛИ НЕ (СформированСМ ИЛИ рарусИмущественныйУчетСервер.ЭтоЗагруженИзБМ(Ссылка));
	Если НЕ СформированСМ
		 И НЕ рарусИмущественныйУчетСервер.ЭтоЗагруженИзБМ(Ссылка) Тогда
		ОбщегоНазначения.СообщитьПользователю("Документ создан в береговом модуле, редактирование запрещено");
	КонецЕсли;
	// -- rarus makole 2021-03-31
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеСлужебныхРеквизитов

Процедура ИнициализироватьДокумент(ДанныеЗаполнения)
	
	Если Не ЗначениеЗаполнено(Дата) тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Склад) тогда
		Склад = рарусОбщегоНазначенияСервер.СкладСудна();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) тогда
		Организация = рарусОбщегоНазначенияСервер.ОсновнаяОрганизация();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидОперации) тогда
		ВидОперации = ПредопределенноеЗначение("Перечисление.рарусВидыОперацийРасходаТМЦ.СоСклада");
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	// ++ rarus makole 2021-03-31
	СформированСМ = Истина;
	// -- rarus makole 2021-03-31
	
КонецПроцедуры

#КонецОбласти

// См. описание в комментарии к одноименной процедуре в модуле УправлениеДоступом.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
		
КонецПроцедуры


#КонецОбласти

#КонецЕсли
